import React from "react";
import WOW from 'wowjs'


class Information extends React.Component {


    componentDidMount() {
        new WOW.WOW().init();
    };

    render() {
        return (
            <React.Fragment>
                <section className="info mb-5">
                    <div className="container ">
                        <div className="row">
                            <div className="col-12 mb-5 pb-5 text-center ">
                                <h2 className="text-white">نحن افضل خيار لك!</h2>
                                <p className=" info-p text-white col-10 m-auto text-center">
                                    تم بناء منصة ميسان لتقدم كل من الجودة والكفاءة اللازمة لادارة طلبات الشحن لكل من الافراد واصحاب العمل و لتعزيز النمو فى مجال التجارة الالكترونية واتاحة الفرص للعديد من المشاريع الناشئة ان تقوم بالاعتماد على هذه المنصة لتغطية حاجتها من ادوات ادارة الشحنات.
                                </p>
                            </div>
                            <div className="col-12 col-lg-4 text-center p-2">
                                <div className="pt-4 pr-lg-4 text-center text-lg-right wow heartBeat">
                                    <div>
                                        <svg width={76} height={70} viewBox="0 0 76 70" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path opacity="0.1" d="M40.4619 70C59.7919 70 75.4619 54.33 75.4619 35C75.4619 15.67 59.7919 0 40.4619 0C21.1319 0 5.46191 15.67 5.46191 35C5.46191 54.33 21.1319 70 40.4619 70Z" fill="#474DFF" />
                                            <path d="M35.7839 52.0871H29.4619C25.6163 52.0871 21.9281 50.5594 19.2089 47.8401C16.4896 45.1208 14.9619 41.4327 14.9619 37.5871V27.2051C14.9619 23.3594 16.4896 19.6713 19.2089 16.952C21.9281 14.2328 25.6163 12.7051 29.4619 12.7051H51.9619C55.8076 12.7051 59.4957 14.2328 62.215 16.952C64.9342 19.6713 66.4619 23.3594 66.4619 27.2051V37.5871C66.4619 41.4327 64.9342 45.1208 62.215 47.8401C59.4957 50.5594 55.8076 52.0871 51.9619 52.0871H45.6899L40.7369 57.0401L35.7839 52.0871Z" fill="url(#paint0_linear)" stroke="white" strokeWidth={2} />
                                            <path d="M48.163 36.2942V36.9842C48.1576 37.3819 47.9972 37.7618 47.7159 38.043C47.4346 38.3243 47.0547 38.4847 46.657 38.4902H34.61C34.2123 38.4847 33.8324 38.3243 33.5511 38.043C33.2698 37.7618 33.1094 37.3819 33.104 36.9842V36.2942C33.104 34.4742 35.237 33.3452 37.245 32.4672L37.433 32.3732C37.508 32.3391 37.5902 32.3242 37.6724 32.3296C37.7546 32.335 37.8341 32.3606 37.904 32.4042C38.7038 32.9366 39.6432 33.2206 40.604 33.2202C41.5632 33.2101 42.4998 32.9271 43.304 32.4042C43.3739 32.3606 43.4534 32.335 43.5356 32.3296C43.6178 32.3242 43.7 32.3391 43.775 32.3732L43.963 32.4672C46.029 33.3452 48.163 34.4432 48.163 36.2942ZM40.633 23.4312C41.6769 23.486 42.6564 23.9529 43.3563 24.7293C44.0562 25.5057 44.4194 26.5282 44.366 27.5722C44.4194 28.6161 44.0562 29.6386 43.3563 30.415C42.6564 31.1915 41.6769 31.6583 40.633 31.7132C39.5898 31.6573 38.6114 31.19 37.9123 30.4137C37.2132 29.6374 36.8506 28.6155 36.904 27.5722C36.8506 26.5288 37.2132 25.5069 37.9123 24.7306C38.6114 23.9543 39.5898 23.487 40.633 23.4312Z" fill="white" />
                                            <path d="M17.616 19.8469H3" stroke="#FFC432" strokeWidth={5} strokeLinecap="round" />
                                            <path d="M17.6161 27.8469H10.3081" stroke="#FFC432" strokeWidth={5} strokeLinecap="round" />
                                            <path opacity="0.2" d="M45.0117 21.0147C35.0842 20.4944 26.7903 24.7672 26.4868 30.5583C26.1833 36.3493 33.9851 41.4657 43.9126 41.9859C53.8401 42.5062 62.134 38.2334 62.4375 32.4424C62.741 26.6513 54.9392 21.535 45.0117 21.0147Z" fill="url(#paint1_linear)" />
                                            <defs>
                                                <linearGradient id="paint0_linear" x1="40.7119" y1="12.7051" x2="40.7119" y2="57.0401" gradientUnits="userSpaceOnUse">
                                                    <stop stopColor="#545AEE" />
                                                    <stop offset="1" stopColor="#3B43FF" />
                                                </linearGradient>
                                                <linearGradient id="paint1_linear" x1="43.9126" y1="41.9859" x2="45.0117" y2="21.0147" gradientUnits="userSpaceOnUse">
                                                    <stop stopColor="white" />
                                                    <stop offset="1" stopColor="white" stopOpacity="0" />
                                                </linearGradient>
                                                <linearGradient id="paint2_linear" x1="45.0088" y1="40.7879" x2="29.9098" y2="26.1929" gradientUnits="userSpaceOnUse">
                                                    <stop stopColor="white" />
                                                    <stop offset="1" stopColor="white" stopOpacity="0" />
                                                </linearGradient>
                                            </defs>
                                        </svg>
                                    </div>
                                    <h5 className="mt-4 mb-3 text-white">دعم فني متواصل</h5>
                                    <p className="mt-3 info-card text-white">
                                        نقدم لك فى ميسان فريق متميز<br />
                                        فى خدمة العملاء و الدعم الفنى و المبيعات للتأكد من
                                        <br />حصولك على الخدمة المطلوبة بالشكل الكلوب دائما.ً
                                    </p>
                                </div>

                            </div>
                            <div className="col-12 col-lg-4 text-center text-lg-right p-2 text-right">
                                <div className="content py-4 wow heartBeat pr-lg-4 text-center text-lg-right">
                                    <div>
                                        <svg width="70" height="70" viewBox="0 0 70 70" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path opacity="0.1" d="M35 70C54.33 70 70 54.33 70 35C70 15.67 54.33 0 35 0C15.67 0 0 15.67 0 35C0 54.33 15.67 70 35 70Z" fill="#474DFF" />
                                            <path d="M20.5 17H50C52.9174 17 55.7153 18.1589 57.7782 20.2218C59.8411 22.2847 61 25.0826 61 28V45.382C61 48.2994 59.8411 51.0973 57.7782 53.1602C55.7153 55.2231 52.9174 56.382 50 56.382H20.5C17.5826 56.382 14.7847 55.2231 12.7218 53.1602C10.6589 51.0973 9.5 48.2994 9.5 45.382V28C9.5 25.0826 10.6589 22.2847 12.7218 20.2218C14.7847 18.1589 17.5826 17 20.5 17V17Z" fill="#545AEE" stroke="white" strokeWidth="2" />
                                            <path d="M16.1821 35.332H46.5331" stroke="white" strokeWidth="2" strokeLinecap="round" strokeDasharray="4 4" />
                                            <path d="M10.823 27.332H59.041" stroke="white" strokeWidth="2" strokeLinecap="round" />
                                            <path d="M51 50C53.2091 50 55 48.2091 55 46C55 43.7909 53.2091 42 51 42C48.7909 42 47 43.7909 47 46C47 48.2091 48.7909 50 51 50Z" fill="white" />
                                            <path d="M47 42C47.7911 42 48.5645 42.2346 49.2223 42.6741C49.8801 43.1136 50.3928 43.7384 50.6955 44.4693C50.9983 45.2002 51.0775 46.0044 50.9231 46.7804C50.7688 47.5563 50.3878 48.269 49.8284 48.8284C49.269 49.3878 48.5563 49.7688 47.7804 49.9231C47.0044 50.0775 46.2002 49.9983 45.4693 49.6955C44.7384 49.3928 44.1136 48.8801 43.6741 48.2223C43.2346 47.5645 43 46.7911 43 46C43 44.9391 43.4214 43.9217 44.1716 43.1716C44.9217 42.4214 45.9391 42 47 42V42Z" fill="#FFC432" />
                                        </svg>

                                    </div>
                                    <h5 className="mt-4 mb-3 text-white">
                                        وسائل دفع متعددة
                                    </h5>
                                    <p className="my-3 info-card text-white">
                                        يمكنك الدفع بالعديد من الوسائل<br />
                                        المتاحة لاتمام طلبات الشحن الخاصة بك بشكل اسرع<br />
                                        واكثر مرونة، يمكنك اضافة الرصيد مسبقا ً الى الحساب<br />
                                        الخاص بك، او الاشتراك في احد الباقات المتاحة لدينا.
                                    </p>
                                </div>
                            </div>
                            <div className="col-12 col-lg-4 text-center text-lg-right p-2 text-right">
                                <div className="pt-4 pr-lg-4 wow heartBeat text-center text-lg-right">
                                    <div>
                                        <svg width="71" height="70" viewBox="0 0 71 70" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path opacity="0.1" d="M35.4619 70C54.7919 70 70.4619 54.33 70.4619 35C70.4619 15.67 54.7919 0 35.4619 0C16.1319 0 0.461914 15.67 0.461914 35C0.461914 54.33 16.1319 70 35.4619 70Z" fill="#474DFF" />
                                            <path d="M45.4619 54.383H20.9619C18.0445 54.383 15.2466 53.2241 13.1837 51.1612C11.1208 49.0983 9.96191 46.3004 9.96191 43.383V26C9.96191 23.0826 11.1208 20.2847 13.1837 18.2218C15.2466 16.1589 18.0445 15 20.9619 15H50.4619C53.3793 15 56.1772 16.1589 58.2401 18.2218C60.303 20.2847 61.4619 23.0826 61.4619 26V43.382C61.4645 45.1434 61.0423 46.8795 60.231 48.443H60.2429L60.21 48.481C59.3753 50.0696 58.1664 51.4311 56.6879 52.448L45.4619 65.1V54.383Z" fill="#545AEE" stroke="white" strokeWidth="2" />
                                            <path d="M25.4619 30C26.253 30 27.0264 30.2346 27.6842 30.6741C28.342 31.1136 28.8547 31.7384 29.1574 32.4693C29.4602 33.2002 29.5394 34.0044 29.3851 34.7804C29.2307 35.5563 28.8498 36.269 28.2903 36.8284C27.7309 37.3878 27.0182 37.7688 26.2423 37.9231C25.4664 38.0775 24.6621 37.9983 23.9312 37.6955C23.2003 37.3928 22.5756 36.8801 22.136 36.2223C21.6965 35.5645 21.4619 34.7911 21.4619 34C21.4619 32.9391 21.8833 31.9217 22.6335 31.1716C23.3836 30.4214 24.401 30 25.4619 30V30Z" fill="#FFC432" />
                                            <path d="M37.4619 38C39.6711 38 41.4619 36.2091 41.4619 34C41.4619 31.7909 39.6711 30 37.4619 30C35.2528 30 33.4619 31.7909 33.4619 34C33.4619 36.2091 35.2528 38 37.4619 38Z" fill="white" />
                                            <path d="M48.4619 38C50.6711 38 52.4619 36.2091 52.4619 34C52.4619 31.7909 50.6711 30 48.4619 30C46.2528 30 44.4619 31.7909 44.4619 34C44.4619 36.2091 46.2528 38 48.4619 38Z" fill="white" />
                                            <path opacity="0.2" d="M40.0117 21.0147C30.0842 20.4944 21.7903 24.7672 21.4868 30.5583C21.1833 36.3493 28.9851 41.4657 38.9126 41.9859C48.8401 42.5062 57.134 38.2334 57.4375 32.4424C57.741 26.6513 49.9392 21.535 40.0117 21.0147Z" fill="url(#paint0_linear)" />
                                            <path opacity="0.1" d="M24.9099 26.1929C18.0008 33.3406 15.7799 42.4021 19.9494 46.4324C24.1189 50.4627 33.0998 47.9356 40.0089 40.7879C46.918 33.6403 49.1389 24.5787 44.9694 20.5484C40.7999 16.5181 31.819 19.0453 24.9099 26.1929Z" fill="url(#paint1_linear)" />
                                            <defs>
                                                <linearGradient id="paint0_linear" x1="38.9126" y1="41.9859" x2="40.0117" y2="21.0147" gradientUnits="userSpaceOnUse">
                                                    <stop stopColor="white" />
                                                    <stop offset="1" stopColor="white" stopOpacity="0" />
                                                </linearGradient>
                                                <linearGradient id="paint1_linear" x1="40.0089" y1="40.7879" x2="24.9099" y2="26.1929" gradientUnits="userSpaceOnUse">
                                                    <stop stopColor="white" />
                                                    <stop offset="1" stopColor="white" stopOpacity="0" />
                                                </linearGradient>
                                            </defs>
                                        </svg>



                                    </div>
                                    <h5 className="mt-4 mb-3 text-white">سهولة إدارة طلباتك</h5>
                                    <p className="mt-3 info-card text-white">
                                        تقدم ميسان فى المنصة الخاصة بها الادوات التي تساعدك<br />
                                        على ادارة بيانات عملائك وعنواين التوصيل الخاصة بهم<br />
                                        ومراجعة الشحنات وطباعة فاتورة الشحن فى اي وقت.
                                    </p>
                                </div>

                            </div>
                            <div className="col-12 position-relative ">
                                <div className="position-absolute D1 mt-4">
                                    <svg width="62" height="62" viewBox="0 0 62 62" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M30.721 61.7274C13.9287 61.7274 0.226562 48.0384 0.226562 31.2038C0.226562 14.3693 13.9287 0.738525 30.721 0.738525C47.5134 0.738525 61.2155 14.4275 61.2155 31.2038C61.2155 47.9802 47.5717 61.7274 30.721 61.7274ZM30.721 12.3887C20.3424 12.3887 11.8879 20.8351 11.8879 31.2038C11.8879 41.5725 20.3424 50.0189 30.721 50.0189C41.0996 50.0189 49.5541 41.5725 49.5541 31.2038C49.5541 20.8351 41.1579 12.3887 30.721 12.3887Z" fill="#64CCE3"/>
                                    </svg>
                                </div>
                            </div>
                        </div>
                    </div>
                </section>
            </React.Fragment >
        )
    }
}

export default Information;