import React from 'react';
import Sh from '../../../img/icon/Sh.png';
import Xl from '../../../img/icon/x31 0.png';
import Xm from '../../../img/icon/x35.png';
import CC from '../../../img/icon/conversation.png';
import SS from '../../../img/icon/settings.png';
import plus from "../../../img/icon/plus.svg";
import new_shipment from "../../../img/icon/new_shipment.svg";
import {Link, Redirect} from "react-router-dom";

import Sidebar_Link from "./Sidebar_Link";

class Sidebar extends React.Component {

    state = {
        links: [
            false,
            false,
            false,
            false,
            false,
            false,
            false,
            false
        ],
        sub_link: false
    };

    handleLinkClick = (e) => {
        let links = this.state.links;
        links = links.filter((link) => {
            link = false;
        })
        links[e.target.id] = true;

        switch (e.target.id) {
            case "3":
            case "4":
            case "5":
                this.setState({
                    sub_link: true
                });
                links[3] = true;
                break;
            default:
                this.setState({
                    sub_link: false
                })
        }

        this.setState({links});
    };

    handleShipments

    render() {
        return (
            <React.Fragment>
                <section className="sidebar text-center p-4">

                    <div className="new-shipment align-self-center nav-item d-block d-lg-none">
                        <Link to="/dashboard/new-shipment"
                              className="nav-link d-flex align-items-center position-relative">
                            <img src={plus} className="plus position-absolute"/>
                            <img src={new_shipment} className="px-1"/>
                            <span className="px-1 pt-1">شحنة جديدة</span>
                        </Link>
                    </div>


                    <Link
                        to="/dashboard"
                        className="row py-3 d-flex justify-content-center align-items-center"
                        onClick={(e) => {
                            this.handleLinkClick(e)
                        }}
                    >
                        <div className="col-3 text-center">
                            <svg width="32" height="18" viewBox="0 0 32 18" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M28 9.33333H27.8667C27.9333 9.13333 28 8.93333 28 8.66667V2C28 0.866667 27.1333 0 26 0H24.6667H22H20.6667C19.5333 0 18.6667 0.866667 18.6667 2V8.66667C18.6667 8.93333 18.7333 9.13333 18.8 9.33333H13.2C13.2667 9.13333 13.3333 8.93333 13.3333 8.66667V2C13.3333 0.866667 12.4667 0 11.3333 0H10H7.33333H6C4.86667 0 4 0.866667 4 2V8.66667C4 8.93333 4.06667 9.13333 4.13333 9.33333H4C1.8 9.33333 0 11.1333 0 13.3333C0 15.5333 1.8 17.3333 4 17.3333H28C30.2 17.3333 32 15.5333 32 13.3333C32 11.1333 30.2 9.33333 28 9.33333ZM24 1.33333V4H22.6667V1.33333H24ZM20 8.66667V2C20 1.6 20.2667 1.33333 20.6667 1.33333H21.3333V4.66667C21.3333 5.06667 21.6 5.33333 22 5.33333H24.6667C25.0667 5.33333 25.3333 5.06667 25.3333 4.66667V1.33333H26C26.4 1.33333 26.6667 1.6 26.6667 2V8.66667C26.6667 9.06667 26.4 9.33333 26 9.33333H20.6667C20.2667 9.33333 20 9.06667 20 8.66667ZM9.33333 1.33333V4H8V1.33333H9.33333ZM5.33333 8.66667V2C5.33333 1.6 5.6 1.33333 6 1.33333H6.66667V4.66667C6.66667 5.06667 6.93333 5.33333 7.33333 5.33333H10C10.4 5.33333 10.6667 5.06667 10.6667 4.66667V1.33333H11.3333C11.7333 1.33333 12 1.6 12 2V8.66667C12 9.06667 11.7333 9.33333 11.3333 9.33333H6C5.6 9.33333 5.33333 9.06667 5.33333 8.66667ZM28 16H4C2.53333 16 1.33333 14.8 1.33333 13.3333C1.33333 11.8667 2.53333 10.6667 4 10.6667H6H11.3333H20.6667H26H28C29.4667 10.6667 30.6667 11.8667 30.6667 13.3333C30.6667 14.8 29.4667 16 28 16Z"
                                    fill={this.state.links[0] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M5.3335 11.3333C4.20016 11.3333 3.3335 12.2 3.3335 13.3333C3.3335 14.4667 4.20016 15.3333 5.3335 15.3333C6.46683 15.3333 7.3335 14.4667 7.3335 13.3333C7.3335 12.2 6.46683 11.3333 5.3335 11.3333ZM5.3335 14C4.9335 14 4.66683 13.7333 4.66683 13.3333C4.66683 12.9333 4.9335 12.6667 5.3335 12.6667C5.7335 12.6667 6.00016 12.9333 6.00016 13.3333C6.00016 13.7333 5.7335 14 5.3335 14Z"
                                    fill={this.state.links[0] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M10.6665 11.3333C9.53317 11.3333 8.6665 12.2 8.6665 13.3333C8.6665 14.4667 9.53317 15.3333 10.6665 15.3333C11.7998 15.3333 12.6665 14.4667 12.6665 13.3333C12.6665 12.2 11.7998 11.3333 10.6665 11.3333ZM10.6665 14C10.2665 14 9.99984 13.7333 9.99984 13.3333C9.99984 12.9333 10.2665 12.6667 10.6665 12.6667C11.0665 12.6667 11.3332 12.9333 11.3332 13.3333C11.3332 13.7333 11.0665 14 10.6665 14Z"
                                    fill={this.state.links[0] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M16 11.3333C14.8667 11.3333 14 12.2 14 13.3333C14 14.4667 14.8667 15.3333 16 15.3333C17.1333 15.3333 18 14.4667 18 13.3333C18 12.2 17.1333 11.3333 16 11.3333ZM16 14C15.6 14 15.3333 13.7333 15.3333 13.3333C15.3333 12.9333 15.6 12.6667 16 12.6667C16.4 12.6667 16.6667 12.9333 16.6667 13.3333C16.6667 13.7333 16.4 14 16 14Z"
                                    fill={this.state.links[0] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M21.3335 11.3333C20.2002 11.3333 19.3335 12.2 19.3335 13.3333C19.3335 14.4667 20.2002 15.3333 21.3335 15.3333C22.4668 15.3333 23.3335 14.4667 23.3335 13.3333C23.3335 12.2 22.4668 11.3333 21.3335 11.3333ZM21.3335 14C20.9335 14 20.6668 13.7333 20.6668 13.3333C20.6668 12.9333 20.9335 12.6667 21.3335 12.6667C21.7335 12.6667 22.0002 12.9333 22.0002 13.3333C22.0002 13.7333 21.7335 14 21.3335 14Z"
                                    fill={this.state.links[0] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M26.6665 11.3333C25.5332 11.3333 24.6665 12.2 24.6665 13.3333C24.6665 14.4667 25.5332 15.3333 26.6665 15.3333C27.7998 15.3333 28.6665 14.4667 28.6665 13.3333C28.6665 12.2 27.7998 11.3333 26.6665 11.3333ZM26.6665 14C26.2665 14 25.9998 13.7333 25.9998 13.3333C25.9998 12.9333 26.2665 12.6667 26.6665 12.6667C27.0665 12.6667 27.3332 12.9333 27.3332 13.3333C27.3332 13.7333 27.0665 14 26.6665 14Z"
                                    fill={this.state.links[0] ? "#4E2F8A" : "#4F4F4F"}/>
                            </svg>
                        </div>
                        <div id="0"
                             className={this.state.links[0] ? "col-9 px-0 text-right active" : "col-9 px-0 text-right"}>
                            منصة الشحن
                        </div>
                    </Link>
                    <Link
                        to=""
                        className=" row py-3 d-flex justify-content-center align-items-center"
                        onClick={(e) => {
                            this.handleLinkClick(e)
                        }}
                    >
                        <div className=" col-3 text-center">
                            <svg width="
                        21" height="21" viewBox="0 0 21 21" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M19.6875 0H12.6875H8.3125H1.3125C0.56875 0 0 0.56875 0 1.3125V19.6875C0 20.4312 0.56875 21 1.3125 21H19.6875C20.4312 21 21 20.4312 21 19.6875V1.3125C21 0.56875 20.4312 0 19.6875 0ZM12.25 0.875V7.4375C12.25 7.7 12.075 7.875 11.8125 7.875H9.1875C8.925 7.875 8.75 7.7 8.75 7.4375V0.875H12.25ZM20.125 19.6875C20.125 19.95 19.95 20.125 19.6875 20.125H1.3125C1.05 20.125 0.875 19.95 0.875 19.6875V1.3125C0.875 1.05 1.05 0.875 1.3125 0.875H7.875V7.4375C7.875 8.18125 8.44375 8.75 9.1875 8.75H11.8125C12.5562 8.75 13.125 8.18125 13.125 7.4375V0.875H19.6875C19.95 0.875 20.125 1.05 20.125 1.3125V19.6875Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M3.0625 10.5C2.8 10.5 2.625 10.675 2.625 10.9375V17.9375C2.625 18.2 2.8 18.375 3.0625 18.375C3.325 18.375 3.5 18.2 3.5 17.9375V10.9375C3.5 10.675 3.325 10.5 3.0625 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M17.9375 10.5C17.675 10.5 17.5 10.675 17.5 10.9375V17.9375C17.5 18.2 17.675 18.375 17.9375 18.375C18.2 18.375 18.375 18.2 18.375 17.9375V10.9375C18.375 10.675 18.2 10.5 17.9375 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M4.8125 10.5C4.55 10.5 4.375 10.675 4.375 10.9375V16.1875C4.375 16.45 4.55 16.625 4.8125 16.625C5.075 16.625 5.25 16.45 5.25 16.1875V10.9375C5.25 10.675 5.075 10.5 4.8125 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M6.5625 10.5C6.3 10.5 6.125 10.675 6.125 10.9375V16.1875C6.125 16.45 6.3 16.625 6.5625 16.625C6.825 16.625 7 16.45 7 16.1875V10.9375C7 10.675 6.825 10.5 6.5625 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M8.3125 10.5C8.05 10.5 7.875 10.675 7.875 10.9375V16.1875C7.875 16.45 8.05 16.625 8.3125 16.625C8.575 16.625 8.75 16.45 8.75 16.1875V10.9375C8.75 10.675 8.575 10.5 8.3125 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M9.625 10.5C9.3625 10.5 9.1875 10.675 9.1875 10.9375V16.1875C9.1875 16.45 9.3625 16.625 9.625 16.625C9.8875 16.625 10.0625 16.45 10.0625 16.1875V10.9375C10.0625 10.675 9.8875 10.5 9.625 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M16.1875 10.5C15.925 10.5 15.75 10.675 15.75 10.9375V16.1875C15.75 16.45 15.925 16.625 16.1875 16.625C16.45 16.625 16.625 16.45 16.625 16.1875V10.9375C16.625 10.675 16.45 10.5 16.1875 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M14.875 10.5C14.6125 10.5 14.4375 10.675 14.4375 10.9375V16.1875C14.4375 16.45 14.6125 16.625 14.875 16.625C15.1375 16.625 15.3125 16.45 15.3125 16.1875V10.9375C15.3125 10.675 15.1375 10.5 14.875 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M13.125 10.5C12.8625 10.5 12.6875 10.675 12.6875 10.9375V16.1875C12.6875 16.45 12.8625 16.625 13.125 16.625C13.3875 16.625 13.5625 16.45 13.5625 16.1875V10.9375C13.5625 10.675 13.3875 10.5 13.125 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                                <path
                                    d="M11.8125 10.5C11.55 10.5 11.375 10.675 11.375 10.9375V16.1875C11.375 16.45 11.55 16.625 11.8125 16.625C12.075 16.625 12.25 16.45 12.25 16.1875V10.9375C12.25 10.675 12.075 10.5 11.8125 10.5Z"
                                    fill={this.state.links[1] ? "#4E2F8A" : "#4F4F4F"}/>
                            </svg>

                        </div>
                        <div id="1"
                             className={this.state.links[1] ? "col-9 px-0 text-right active" : "col-9 px-0 text-right"}>
                            البولصيات
                        </div>
                    </Link>
                    <Link
                        to=""
                        className="row py-3 d-flex justify-content-center align-items-center"
                        onClick={(e) => {
                            this.handleLinkClick(e)
                        }}
                    >
                        <div className="col-3 text-center">

                        </div>
                        <div id="2"
                             className={this.state.links[2] ? "col-9 px-0 text-right active" : "col-9 px-0 text-right"}>
                            العملاء
                        </div>
                    </Link>
                    <Link
                        to=""
                        className={
                            this.state.sub_link ? "row pt-3 d-flex justify-content-center align-items-center"
                                : "row py-3 d-flex justify-content-center align-items-center"
                        }
                        onClick={(e) => {
                            e.preventDefault();
                            this.handleLinkClick(e)
                        }}
                    >
                        <div className="col-3 text-center">
                            <svg width="23" height="20" viewBox="0 0 23 20" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M22.381 15.2381H20.3809C20.4286 15.0952 20.4762 14.9524 20.4762 14.7619V9.04762C20.4762 8.2381 19.8571 7.61905 19.0476 7.61905H17.1429H16.0952C16.1429 7.47619 16.1905 7.33333 16.1905 7.14286V1.42857C16.1905 0.619048 15.5714 0 14.7619 0H12.8571H10H8.09524C7.28571 0 6.66667 0.619048 6.66667 1.42857V7.14286C6.66667 7.33333 6.71429 7.47619 6.76191 7.61905H5.71429H3.80952C3 7.61905 2.38095 8.2381 2.38095 9.04762V14.7619C2.38095 14.9524 2.42858 15.0952 2.4762 15.2381H0.47619C0.190476 15.2381 0 15.4286 0 15.7143V17.619V19.5238C0 19.8095 0.190476 20 0.47619 20H2.38095C2.66667 20 2.85714 19.8095 2.85714 19.5238V18.0952H10V19.5238C10 19.8095 10.1905 20 10.4762 20H12.381C12.6667 20 12.8571 19.8095 12.8571 19.5238V18.0952H20V19.5238C20 19.8095 20.1905 20 20.4762 20H22.381C22.6667 20 22.8571 19.8095 22.8571 19.5238V17.619V15.7143C22.8571 15.4286 22.6667 15.2381 22.381 15.2381ZM19.5238 9.04762V14.7619C19.5238 15.0476 19.3333 15.2381 19.0476 15.2381H12.381C12.0952 15.2381 11.9048 15.0476 11.9048 14.7619V9.04762C11.9048 8.7619 12.0952 8.57143 12.381 8.57143H13.8095V10.9524C13.8095 11.7619 14.4286 12.381 15.2381 12.381H16.1905C17 12.381 17.619 11.7619 17.619 10.9524V8.57143H19.0476C19.3333 8.57143 19.5238 8.7619 19.5238 9.04762ZM16.6667 10.9524C16.6667 11.2381 16.4762 11.4286 16.1905 11.4286H15.2381C14.9524 11.4286 14.7619 11.2381 14.7619 10.9524V8.57143H16.6667V10.9524ZM12.381 0.952381V3.33333C12.381 3.61905 12.1905 3.80952 11.9048 3.80952H10.9524C10.6667 3.80952 10.4762 3.61905 10.4762 3.33333V0.952381H12.381ZM7.61905 7.14286V1.42857C7.61905 1.14286 7.80952 0.952381 8.09524 0.952381H9.52381V3.33333C9.52381 4.14286 10.1429 4.7619 10.9524 4.7619H11.9048C12.7143 4.7619 13.3333 4.14286 13.3333 3.33333V0.952381H14.7619C15.0476 0.952381 15.2381 1.14286 15.2381 1.42857V7.14286C15.2381 7.42857 15.0476 7.61905 14.7619 7.61905H14.2857H12.381H10.4762H8.57143H8.09524C7.80952 7.61905 7.61905 7.42857 7.61905 7.14286ZM8.09524 8.57143V10.9524C8.09524 11.2381 7.90476 11.4286 7.61905 11.4286H6.66667C6.38095 11.4286 6.19048 11.2381 6.19048 10.9524V8.57143H8.09524ZM3.33333 14.7619V9.04762C3.33333 8.7619 3.52381 8.57143 3.80952 8.57143H5.2381V10.9524C5.2381 11.7619 5.85714 12.381 6.66667 12.381H7.61905C8.42857 12.381 9.04762 11.7619 9.04762 10.9524V8.57143H10.4762C10.7619 8.57143 10.9524 8.7619 10.9524 9.04762V14.7619C10.9524 15.0476 10.7619 15.2381 10.4762 15.2381H3.80952C3.52381 15.2381 3.33333 15.0476 3.33333 14.7619ZM0.952381 16.1905H3.80952H10.4762H12.381H19.0476H21.9048V17.1429H20.4762H12.381H10.4762H2.38095H0.952381V16.1905ZM1.90476 19.0476H0.952381V18.0952H1.90476V19.0476ZM11.9048 19.0476H10.9524V18.0952H11.9048V19.0476ZM21.9048 19.0476H20.9524V18.0952H21.9048V19.0476Z"
                                    fill={this.state.links[3] ? "#4E2F8A" : "#4F4F4F"}/>
                            </svg>

                        </div>
                        <div id="3"
                             className={this.state.links[3] ? "col-9 px-0 text-right active" : "col-9 px-0 text-right"}>
                            الشحنات
                        </div>
                    </Link>
                    <div className={this.state.sub_link ? "hidden_links d-block" : "hidden_links d-none"}>
                        <Link
                            to="/dashboard/shipments"
                            className="row d-flex justify-content-center align-items-center"
                            onClick={(e) => {
                                this.handleLinkClick(e)
                            }}
                        >
                            <div className="col-3 text-center">

                            </div>
                            <div id="4"
                                 className={this.state.links[4] ? "col-9 px-0 text-right active" : "col-9 px-0 text-right"}>
                                قائمة الشحنات
                            </div>
                        </Link>
                        <Link
                            to="/dashboard/new-shipment"
                            className="row d-flex justify-content-center align-items-center"
                            onClick={(e) => {
                                this.handleLinkClick(e)
                            }}
                        >
                            <div className="col-3 text-center">

                            </div>
                            <div id="5"
                                 className={this.state.links[5] ? "col-9 px-0 text-right active" : "col-9 px-0 text-right"}>
                                ارسال شحنة جديدة
                            </div>
                        </Link>
                    </div>
                    <Link
                        to=""
                        className="row py-3 d-flex justify-content-center align-items-center"
                        onClick={(e) => {
                            this.handleLinkClick(e)
                        }}
                    >
                        <div className="col-3 text-center">

                        </div>
                        <div id="6"
                             className={this.state.links[6] ? "col-9 px-0 text-right active" : "col-9 px-0 text-right"}>
                            المساعدة
                        </div>
                    </Link>
                    <Link
                        to=""
                        className="row py-3 d-flex justify-content-center align-items-center"
                        onClick={(e) => {
                            this.handleLinkClick(e)
                        }}
                    >
                        <div className="col-3 text-center">

                        </div>
                        <div id="7"
                             className={this.state.links[7] ? "col-9 px-0 text-right active" : "col-9 px-0 text-right"}>
                            الاعدادات
                        </div>
                    </Link>
                </section>
            </React.Fragment>
        )
    }
}

export default Sidebar;